In [252]:
import pandas as pd

In [253]:
li = ['apple' , 'banana', 'mango', 'strawberry']

In [254]:
ser = pd.Series(li)

In [255]:
type(ser)

pandas.core.series.Series

In [256]:
di = {4 : 'apple', 5: 'banana', 6: 'mango'}

In [257]:
ser = pd.Series(di)

In [258]:
ser

4     apple
5    banana
6     mango
dtype: object

In [259]:
ser.values

array(['apple', 'banana', 'mango'], dtype=object)

In [260]:
ser.index

Index([4, 5, 6], dtype='int64')

In [261]:
li = [1,2,3,4,5]
num = pd.Series(li)

In [262]:
num.dtype

dtype('int64')

In [263]:
num.sum()

15

In [264]:
num.product()

120

In [265]:
num.mean()

3.0

In [266]:
li1 = ['monday', 'tuesday', 'wednesday', 'thursday', 'friday', 'monday']
li2 = ['banana', 'apple', 'strawberry', 'mango', 'peach' ,'melon']

In [267]:
fruits = pd.Series(data = li2, index = li1)

In [268]:
fruits

monday           banana
tuesday           apple
wednesday    strawberry
thursday          mango
friday            peach
monday            melon
dtype: object

In [269]:
nba = pd.read_csv(r"C:\Users\vvick\Downloads\nba.csv", usecols=['Name', 'Age'], index_col='Name')

In [270]:
nba

                Age
Name
Avery Bradley  25.0
Jae Crowder    25.0
John Holland   27.0
R.J. Hunter    22.0
Jonas Jerebko  29.0
...             ...
Shelvin Mack   26.0
Raul Neto      24.0
Tibor Pleiss   26.0
Jeff Withey    26.0
NaN             NaN

[458 rows x 1 columns]

In [271]:
first_player = nba.loc['Jae Crowder']

In [272]:
type(first_player)

pandas.core.series.Series

In [273]:
first_player.is_unique

True

In [274]:
type(nba)

pandas.core.frame.DataFrame

In [275]:
list(nba)

['Age']

In [276]:
first_player

Age    25.0
Name: Jae Crowder, dtype: float64

In [277]:
first_player.dtype

dtype('float64')

In [278]:
nba.ndim

2

In [279]:
nba.shape

(458, 1)

In [280]:
nba.size

458

In [281]:
nba.sort_values(by='Age')

                     Age
Name
Rashad Vaughn       19.0
Devin Booker        19.0
Kristaps Porzingis  20.0
Tyus Jones          20.0
Cliff Alexander     20.0
...                  ...
Pablo Prigioni      39.0
Tim Duncan          40.0
Kevin Garnett       40.0
Andre Miller        40.0
NaN                  NaN

[458 rows x 1 columns]

In [282]:
nba = pd.read_csv(r"C:\Users\vvick\Downloads\nba.csv", usecols=['Name', 'Age'], index_col='Name').dropna()

In [283]:
nba

                Age
Name
Avery Bradley  25.0
Jae Crowder    25.0
John Holland   27.0
R.J. Hunter    22.0
Jonas Jerebko  29.0
...             ...
Trey Lyles     20.0
Shelvin Mack   26.0
Raul Neto      24.0
Tibor Pleiss   26.0
Jeff Withey    26.0

[457 rows x 1 columns]

In [284]:
type(nba)

pandas.core.frame.DataFrame

In [285]:
nba = nba.squeeze()

In [286]:
nba = nba.copy()

In [287]:
nba.sort_values(ascending=False, inplace=True)

In [288]:
nba

Name
Andre Miller          40.0
Kevin Garnett         40.0
Tim Duncan            40.0
Vince Carter          39.0
Pablo Prigioni        39.0
                      ...
Kristaps Porzingis    20.0
Tyus Jones            20.0
Christian Wood        20.0
Rashad Vaughn         19.0
Devin Booker          19.0
Name: Age, Length: 457, dtype: float64

In [289]:
nba = pd.read_csv(r"C:\Users\vvick\Downloads\nba.csv", usecols=['Name', 'Age'], index_col='Name').dropna()

In [290]:
nb = nba.squeeze().copy()

In [291]:
nb.sort_index(inplace=True)

In [292]:
nb

Name
Aaron Brooks       31.0
Aaron Gordon       20.0
Aaron Harrison     21.0
Adreian Payne      25.0
Al Horford         30.0
                   ...
Wilson Chandler    29.0
Xavier Munford     24.0
Zach LaVine        21.0
Zach Randolph      34.0
Zaza Pachulia      32.0
Name: Age, Length: 457, dtype: float64

In [293]:
nb.sort_values(inplace=True)

In [294]:
nb

Name
Rashad Vaughn         19.0
Devin Booker          19.0
Stanley Johnson       20.0
Tyus Jones            20.0
Kristaps Porzingis    20.0
                      ...
Vince Carter          39.0
Pablo Prigioni        39.0
Tim Duncan            40.0
Kevin Garnett         40.0
Andre Miller          40.0
Name: Age, Length: 457, dtype: float64

In [295]:
nba.get(1000, default='Player does not exist')

'Player does not exist'

In [296]:
len(nba)

457

In [297]:
nba.count()

Age    457
dtype: int64

In [298]:
nba.sum()

Age    12311.0
dtype: float64

In [299]:
nba.min()

Age    19.0
dtype: float64

In [300]:
nba.mean()

Age    26.938731
dtype: float64

In [301]:
nba.median()

Age    26.0
dtype: float64

In [302]:
nba.describe()

              Age
count  457.000000
mean    26.938731
std      4.404016
min     19.000000
25%     24.000000
50%     26.000000
75%     30.000000
max     40.000000

In [303]:
nba.idxmax()

Age    Tim Duncan
dtype: object

In [304]:
nba.idxmin()

Age    Devin Booker
dtype: object

In [305]:
nba.value_counts().sum()

457

In [306]:
type(nba)

pandas.core.frame.DataFrame

In [307]:
nba = nba.squeeze()

In [308]:
def classify_by_age(num):
    if num<25:
        return 'Junior'
    else:
        return 'Senior'

In [309]:
nba.apply(classify_by_age)

Name
Avery Bradley    Senior
Jae Crowder      Senior
John Holland     Senior
R.J. Hunter      Junior
Jonas Jerebko    Senior
                  ...
Trey Lyles       Junior
Shelvin Mack     Senior
Raul Neto        Junior
Tibor Pleiss     Senior
Jeff Withey      Senior
Name: Age, Length: 457, dtype: object

In [310]:
nba.get(1000000, default='the player is not found')

'the player is not found'

In [311]:
nba

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Trey Lyles       20.0
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
Name: Age, Length: 457, dtype: float64